export const timeTable = (data) => {
  return data ? "课程：" + data.course + "\n 授课教师：" + data.teacher + "\n 教室：" + data.classroom : ""
}



export const defaultData = [
  [
    {
      section: "一",
      2: "课程：高等数学 \n授课教师：张三 \n教室：2-201",
      1: "",
      4: "课程：计算机组成原理 \n授课教师：李四 \n教室：2-106",
      0: "",
    },
    {
      section: "二",
      0: "",
      1: "课程：程序设计基础 \n授课教师：小明 \n教室：2-301",
      3: "课程：高等数学 \n授课教师：小白 \n教室：2-412",
      4: "",
    },
    {
      section: "三",
      1: "课程：计算应用技术 \n授课教师：王五 \n教室：2-211",
    },
    {
      section: "四",
      0: "课程：线性代数 \n授课教师：小灰 \n教室：2-108",
    },
    {
      section: "五",
      0: "",
      1: "",
      2: "",
      3: "",
      4: "",
    },
  ],
  [
    {
      section: "一",
      1: "课程：高等数学 \n授课教师：张三 \n教室：2-201",
      0: "课程：计算机组成原理 \n授课教师：李四 \n教室：2-106",
    },
    {
      section: "二",
      0: "",
      2: "课程：程序设计基础 \n授课教师：小明 \n教室：2-301",
      3: "课程：高等数学 \n授课教师：小白 \n教室：2-412",
      4: "",
    },
    {
      section: "三",
      0: "课程：计算应用技术 \n授课教师：王五 \n教室：2-211",
    },
    {
      section: "四",
      4: "课程：线性代数 \n授课教师：小灰 \n教室：2-108",
    },
    {
      section: "五",
      0: "",
      1: "",
      2: "",
      3: "",
      4: "",
    },
  ],
  [
    {
      section: "一",
      3: "课程：高等数学 \n授课教师：张三 \n教室：2-201",
      1: "课程：计算机组成原理 \n授课教师：李四 \n教室：2-106",
    },
    {
      section: "二",
      2: "课程：程序设计基础 \n授课教师：小明 \n教室：2-301",
      0: "课程：高等数学 \n授课教师：小白 \n教室：2-412",
    },
    {
      section: "三",
      1: "课程：计算应用技术 \n授课教师：王五 \n教室：2-211",
    },
    {
      section: "四",
      4: "课程：线性代数 \n授课教师：小灰 \n教室：2-108",
    },
    {
      section: "五",
      0: "",
      1: "",
      2: "",
      3: "",
      4: "",
    },
  ],
  [
    {
      section: "一",
      4: "课程：高等数学 \n授课教师：张三 \n教室：2-201",
    },
    {
      section: "二",
      2: "课程：程序设计基础 \n授课教师：小明 \n教室：2-301",
    },
    {
      section: "三",
      1: "课程：计算应用技术 \n授课教师：王五 \n教室：2-211",
      4: "课程：计算机组成原理 \n授课教师：李四 \n教室：2-106",
    },
    {
      section: "四",
      0: "课程：线性代数 \n授课教师：小灰 \n教室：2-108",
      1: "课程：高等数学 \n授课教师：小白 \n教室：2-412",
    },
    {
      section: "五",
      0: "",
      1: "",
      2: "",
      3: "",
      4: "",
    },
  ],
  [
    {
      section: "一",
      4: "课程：高等数学 \n授课教师：张三 \n教室：2-201",
      0: "课程：线性代数 \n授课教师：小灰 \n教室：2-108",
    },
    {
      section: "二",
      1: "课程：计算应用技术 \n授课教师：王五 \n教室：2-211",
      2: "课程：程序设计基础 \n授课教师：小明 \n教室：2-301",
    },
    {
      section: "三",
      4: "课程：计算机组成原理 \n授课教师：李四 \n教室：2-106",
    },
    {
      section: "四",
      1: "课程：高等数学 \n授课教师：小白 \n教室：2-412",
    },
    {
      section: "五",
      0: "",
      1: "",
      2: "",
      3: "",
      4: "",
    },
  ],
  [
    {
      section: "一",
      0: "课程：高等数学 \n授课教师：张三 \n教室：2-201",
      3: "课程：线性代数 \n授课教师：小灰 \n教室：2-108",
    },
    {
      section: "二",
      3: "课程：计算应用技术 \n授课教师：王五 \n教室：2-211",
    },
    {
      section: "三",
      4: "课程：计算机组成原理 \n授课教师：李四 \n教室：2-106",
      1: "课程：程序设计基础 \n授课教师：小明 \n教室：2-301",
    },
    {
      section: "四",
      1: "课程：高等数学 \n授课教师：小白 \n教室：2-412",
    },
    {
      section: "五",
      0: "",
      1: "",
      2: "",
      3: "",
      4: "",
    },
  ],
]

export const studentData = [

]

export const emptyRoom = [
  {
    one: [
      "1-101",
      "1-103",
      "1-104",
      "1-106",
      "1-101",
      "1-110",
      "1-111",
      "1-112",
    ],

    two: [
      "1-201",
      "1-203",
      "1-204",
      "1-206",
      "1-201",
      "1-210",
      "1-211",
      "1-212",
    ],

    three: [
      "1-301",
      "1-303",
      "1-304",
      "1-306",
      "1-301",
      "1-310",
      "1-311",
      "1-312",
    ],

    four: ["1-401", "1-403", "1-404", "1-406", "1-408", "1-410", "1-411", "1-412"],

    five: [
      "1-501",
      "1-503",
      "1-504",
      "1-506",
      "1-501",
      "1-510",
      "1-511",
      "1-512",
    ]
  },
  {
    one: [
      "2-101",
      "2-103",
      "2-104",
      "2-106",
      "2-101",
      "2-110",
      "2-111",
      "2-112",
    ],

    two: [
      "2-201",
      "2-203",
      "2-204",
      "2-206",
      "2-201",
      "2-210",
      "2-211",
      "2-212",
    ],

    three: [
      "2-301",
      "2-303",
      "2-304",
      "2-306",
      "2-301",
      "2-308",
      "2-301",
      "2-310",
      "2-311",
      "2-312",
    ],

    four: [
      "2-402",
      "2-403", 
      "2-404", 
      "2-406", 
      "2-401", 
      "2-405",
      "2-407",
      "2-408",
      "2-410", 
      "2-411", 
      "2-412",
    ],

    five: [
      "2-501",
      "2-503",
      "2-504",
      "2-506",
      "2-501",
      "2-510",
      "2-511",
      "2-512",
    ]
  },
  {
    one: [
      "3-101",
      "3-103",
      "3-104",
      "3-106",
      "3-101",
      "3-110",
      "3-111",
      "3-112",
    ],

    two: [
      "3-201",
      "3-203",
      "3-204",
      "3-206",
      "3-201",
      "3-210",
      "3-211",
      "3-212",
    ],

    three: [
      "3-301",
      "3-303",
      "3-304",
      "3-306",
      "3-301",
      "3-308",
      "3-301",
      "3-310",
      "3-311",
      "3-312",
    ],

    four: [
      "3-402",
      "3-403", 
      "3-404", 
      "3-406", 
      "3-401", 
      "3-405",
      "3-407",
      "3-408",
      "3-410", 
      "3-411", 
      "3-412",
    ],

    five: [
      "3-501",
      "3-503",
      "3-504",
      "3-506",
      "3-501",
      "3-510",
      "3-511",
      "3-512",
    ]
  },
]

export const teacherData = [
  [
    {
      section: "一",
      2: "课程：高等数学 \n授课教师：张三 \n教室：2-201",
      1: "",
      4: "课程：高等数学 \n授课教师：张三 \n教室：2-211",
      0: "",
    },
    {
      section: "二",
      0: "",
      1: "课程：高等数学 \n授课教师：张三 \n教室：2-101",
      4: "",
    },
    {
      section: "三",
    },
    {
      section: "四",
      3: "课程：高等数学 \n授课教师：张三 \n教室：2-305",

    },
    {
      section: "五",
      0: "",
      1: "",
      2: "课程：高等数学 \n授课教师：张三 \n教室：2-512",
      3: "",
      4: "",
    },
  ],
  [
    {
      section: "一",
      3: "课程：高等数学 \n授课教师：张三 \n教室：2-201",
      1: "",
      0: "",
    },
    {
      section: "二",
      0: "",
      2: "课程：高等数学 \n授课教师：张三 \n教室：2-101",
      4: "",
    },
    {
      section: "三",
      0: "课程：高等数学 \n授课教师：张三 \n教室：2-211",
    },
    {
      section: "四",
      1: "课程：高等数学 \n授课教师：张三 \n教室：2-305",

    },
    {
      section: "五",
      0: "",
      1: "",
      3: "课程：高等数学 \n授课教师：张三 \n教室：2-512",
      4: "",
    },
  ],
]